////////////////////////////////////////////////////////////////////////////////
// Подсистема "Информация при запуске".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Обработчики служебных событий.

// Вызывается после запуска конфигурации, подключает обработчик ожидания, который открывает окно информации.
Процедура ПослеНачалаРаботыСистемы() Экспорт
	
	ПараметрыКлиента = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиентаПриЗапуске();
	Если ПараметрыКлиента.Свойство("ИнформацияПриЗапуске") И ПараметрыКлиента.ИнформацияПриЗапуске.Показывать Тогда
		ПодключитьОбработчикОжидания("ПоказатьИнформациюПослеЗапуска", 0.2, Истина);
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из обработчика ожидания, открывает окно информации.
Процедура Показать() Экспорт
	ОткрытьФорму("Обработка.ИнформацияПриЗапуске.Форма");
КонецПроцедуры

#КонецОбласти
